; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 988314 1 3 4 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	thermograph3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star6 - direction
	Star4 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star6)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
)
(:goal (and
	(have_image Star7 spectrograph2)
	(have_image Star8 spectrograph1)
	(have_image Planet9 spectrograph1)
	(have_image Planet10 spectrograph1)
	(have_image Star11 spectrograph2)
	(have_image Star12 spectrograph2)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (turn_to satellite0 star4 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star4)
   goals met: 0 of 6
3. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 6
4. (turn_to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
5. (take_image satellite0 star7 instrument2 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 1 of 6
6. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 1 of 6
7. (turn_to satellite0 star12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star12)
   goals met: 1 of 6
8. (take_image satellite0 star12 instrument2 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 2 of 6
9. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 2 of 6
10. (turn_to satellite0 star11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star11)
   goals met: 2 of 6
11. (take_image satellite0 star11 instrument2 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 3 of 6
12. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 6
13. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 3 of 6
14. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 6
15. (turn_to satellite0 star4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star4)
   goals met: 3 of 6
16. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 3 of 6
17. (turn_to satellite0 star8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star8)
   goals met: 3 of 6
18. (take_image satellite0 star8 instrument1 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 4 of 6
19. (turn_to satellite0 planet9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet9)
   goals met: 4 of 6
20. (take_image satellite0 planet9 instrument1 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 5 of 6
21. (turn_to satellite0 planet10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet10)
   goals met: 5 of 6
22. (take_image satellite0 planet10 instrument1 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 6 of 6
